app/views/menu_categories/show.html.erb

SELECT `menu_items`.* FROM `menu_items` WHERE `menu_items`.`menu_category_id` = 2
---
  <ul>
    <% @menu_category.menu_items.each do |menu_item| %>