app/views/restaurants/index.html.erb

    </tr>
    <% current_user.restaurants.each do |restaurant| %>
---
SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`user_id` = 1