app/views/restaurants/show.html.erb

SELECT `menu_categories`.* FROM `menu_categories` WHERE `menu_categories`.`restaurant_id` = 1
---
  <ul>
    <% @restaurant.menu_categories.each do |menu_category| %>

SELECT `tables`.* FROM `tables` WHERE `tables`.`restaurant_id` = 1
---
    <ul>
      <% @restaurant.tables.each do |table| %>