app/controllers/menu_categories_controller.rb

SELECT `menu_categories`.* FROM `menu_categories`
---
  def index
    @menu_categories = MenuCategory.all

SELECT `menu_categories`.* FROM `menu_categories` WHERE `menu_categories`.`id` = 1 LIMIT 1
---
  def show
    @menu_category = MenuCategory.find(params[:id])

SELECT `menu_categories`.* FROM `menu_categories` WHERE `menu_categories`.`id` = 3 LIMIT 1
---
  def edit
    @menu_category = MenuCategory.find(params[:id])

INSERT INTO `menu_categories` (`created_at`, `name`, `restaurant_id`, `updated_at`) VALUES ('2012-11-07 15:35:05', '에스프레소', NULL, '2012-11-07 15:35:05')
---
  def create
    @menu_category = MenuCategory.new(params[:menu_category])

    respond_to do |format|
      if @menu_category.save

SELECT `menu_categories`.* FROM `menu_categories` WHERE `menu_categories`.`id` = 2 LIMIT 1
---
  def update
    @menu_category = MenuCategory.find(params[:id])