app/controllers/menu_items_controller.rb

SELECT `menu_items`.* FROM `menu_items`
---
  def index
    @menu_items = MenuItem.all

SELECT `menu_items`.* FROM `menu_items` WHERE `menu_items`.`id` = 1 LIMIT 1
---
  def show
    @menu_item = MenuItem.find(params[:id])

SELECT `menu_items`.* FROM `menu_items` WHERE `menu_items`.`id` = 3 LIMIT 1
---
  def edit
    @menu_item = MenuItem.find(params[:id])

INSERT INTO `menu_items` (`created_at`, `description`, `menu_category_id`, `name`, `price`, `updated_at`) VALUES ('2012-11-07 15:52:33', '맛있는 아메리카노~ 잇힝!', NULL, '아메리카노', 1500, '2012-11-07 15:52:33')
---
  def create
    @menu_item = MenuItem.new(params[:menu_item])

    respond_to do |format|
      if @menu_item.save

SELECT `menu_items`.* FROM `menu_items` WHERE `menu_items`.`id` = 1 LIMIT 1
DELETE FROM `menu_items` WHERE `menu_items`.`id` = 1
---
  def destroy
    @menu_item = MenuItem.find(params[:id])
    @menu_item.destroy