app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
  def show
    @order = Order.find(params[:id])

UPDATE `orders` SET `order_status` = 20, `updated_at` = '2012-11-09 02:00:32' WHERE `orders`.`id` = 2
SELECT `orders`.* FROM `orders` WHERE `orders`.`table_id` = 1 ORDER BY `orders`.`id` DESC LIMIT 1
---
  def complete
    @order = @current_table.active_order
    @order.update_attribute(:order_status, OrderStatus::REQUESTED)

    advertisements = Advertisement.
      joins("inner join menu_items on menu_items.id = advertisements.menu_item_id").
      joins("inner join sub_orders on menu_items.id = sub_orders.menu_item_id").
      where("sub_orders.order_id = ?", @order.id)

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 3 LIMIT 1
UPDATE `orders` SET `order_status` = 30, `updated_at` = '2012-11-09 03:39:02' WHERE `orders`.`id` = 3
---
  def confirm
    @order = Order.find(params[:id])
    @order.update_attribute(:order_status, OrderStatus::CONFIRMED)