app/controllers/restaurants_controller.rb

SELECT `restaurants`.* FROM `restaurants` LIMIT 1
---
  def index
    @restaurant = Restaurant.first

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
  def show
    @restaurant = Restaurant.find(params[:id])

SELECT `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1
---
  def edit
    @restaurant = Restaurant.find(params[:id])

INSERT INTO `restaurants` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2012-11-07 14:55:32', '누보에서 운영하는 이앙 북카페', '이앙 북카페', '2012-11-07 14:55:32')
---
  def create
    @restaurant = Restaurant.new(params[:restaurant])

    respond_to do |format|
      if @restaurant.save