app/controllers/sub_orders_controller.rb

  def create
    @order = @current_table.active_order
    @sub_order = @order.sub_orders.where(:menu_item_id => params[:sub_order][:menu_item_id]).first
    if @sub_order.nil?
      @sub_order = SubOrder.new(params[:sub_order].merge(:order => @order, :count => 1))
    else
      @sub_order.increment(:count)
    end

    respond_to do |format|
      if @sub_order.save
---
SELECT `sub_orders`.* FROM `sub_orders` WHERE `sub_orders`.`order_id` = 2 AND `sub_orders`.`menu_item_id` = 2 LIMIT 1
UPDATE `sub_orders` SET `count` = 2, `updated_at` = '2012-11-09 04:08:16' WHERE `sub_orders`.`id` = 23
INSERT INTO `sub_orders` (`count`, `created_at`, `menu_item_id`, `order_id`, `updated_at`) VALUES (NULL, '2012-11-08 10:25:30', 2, 2, '2012-11-08 10:25:30')

  def increment
    @sub_order = SubOrder.find(params[:id])
    @sub_order.increment! :count
---
SELECT `sub_orders`.* FROM `sub_orders` WHERE `sub_orders`.`id` = 1 LIMIT 1
UPDATE `sub_orders` SET `count` = 2 WHERE `sub_orders`.`id` = 1

  def decrement
    @sub_order = SubOrder.find(params[:id])
    @sub_order.decrement! :count
    if @sub_order.count == 0
      @sub_order_id = @sub_order.id
      @sub_order.destroy
---
SELECT `sub_orders`.* FROM `sub_orders` WHERE `sub_orders`.`id` = 1 LIMIT 1
UPDATE `sub_orders` SET `count` = -1 WHERE `sub_orders`.`id` = 4
SELECT COUNT(*) FROM `sub_orders` WHERE `sub_orders`.`order_id` = 7
DELETE FROM `sub_orders` WHERE `sub_orders`.`id` = 2