app/controllers/tables_controller.rb

  def edit
    @table = Table.find(params[:id])
---
SELECT `tables`.* FROM `tables` WHERE `tables`.`id` = 1 LIMIT 1

  def create
    @table = Table.new(params[:table])

    respond_to do |format|
      if @table.save
---
INSERT INTO `tables` (`created_at`, `position`, `restaurant_id`, `updated_at`) VALUES ('2012-11-08 03:30:25', 1, 1, '2012-11-08 03:30:25')

  def update
    @table = Table.find(params[:id])

    respond_to do |format|
      if @table.update_attributes(params[:table])
---
SELECT `tables`.* FROM `tables` WHERE `tables`.`id` = 4 LIMIT 1
UPDATE `tables` SET `position` = 2, `updated_at` = '2012-11-08 03:45:33' WHERE `tables`.`id` = 4

  def destroy
    @table = Table.find(params[:id])
    @table.destroy
---
SELECT `tables`.* FROM `tables` WHERE `tables`.`id` = 3 LIMIT 1
DELETE FROM `tables` WHERE `tables`.`id` = 3

  def login_as_table
    @table = Table.find(params[:id])
---
SELECT `tables`.* FROM `tables` WHERE `tables`.`id` = 1 LIMIT 1