app/views/sub_orders/decrement.js.erb

  <% if @sub_order.count == 1 %>
    sub_order.find("a.link_decrement").data("confirm", "<%= I18n.t("menu_items.confirm_delete", :menu_item => @sub_order.menu_item.name) %>");
---
SELECT `menu_items`.* FROM `menu_items` WHERE `menu_items`.`id` = 2 LIMIT 1

  $("#sub_order_<%= @sub_order_id %>").remove();
  <% if @current_table.active_order.sub_orders.empty? %>
    var $active_order = $("#active_order");
    $active_order.find("div.sub_orders").remove();
---
SELECT COUNT(*) FROM `sub_orders` WHERE `sub_orders`.`order_id` = 7
SELECT `orders`.* FROM `orders` WHERE `orders`.`table_id` = 1 ORDER BY `orders`.`id` DESC LIMIT 1
SELECT `sub_orders`.* FROM `sub_orders` WHERE `sub_orders`.`id` = 1 LIMIT 1