app/views/sub_orders/increment.js.erb

<% if @sub_order.count == 1 %>
  sub_order.find("a.link_decrement").data("confirm", "<%= I18n.t("menu_items.confirm_delete", :menu_item => @sub_order.menu_item.name) %>");
---
SELECT `menu_items`.* FROM `menu_items` WHERE `menu_items`.`id` = 3 LIMIT 1